utilitariosAdicionaServico/1

<wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://impl.webservice.ws.declaracao.eicon.com.br/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns2="http://schemas.xmlsoap.org/soap/http" xmlns:ns1="http://nfse.abrasf.org.br" name="NfseImplService" targetNamespace="http://impl.webservice.ws.declaracao.eicon.com.br/">
	<wsdl:binding name="NfseImplServiceSoapBinding" type="ns1:nfse">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="ConsultarNfsePorRps">
			<soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarNfsePorRps" style="document"/>
			<wsdl:input name="ConsultarNfsePorRps">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="ConsultarNfsePorRpsResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="ConsultarNfseServicoTomado">
			<soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarNfseServicoTomado" style="document"/>
			<wsdl:input name="ConsultarNfseServicoTomado">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="ConsultarNfseServicoTomadoResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="RecepcionarLoteRps">
			<soap:operation soapAction="http://nfse.abrasf.org.br/RecepcionarLoteRps" style="document"/>
			<wsdl:input name="RecepcionarLoteRps">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="RecepcionarLoteRpsResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="RecepcionarLoteRpsSincrono">
			<soap:operation soapAction="http://nfse.abrasf.org.br/RecepcionarLoteRpsSincrono" style="document"/>
			<wsdl:input name="RecepcionarLoteRpsSincrono">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="RecepcionarLoteRpsSincronoResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="ConsultarNfseServicoPrestado">
			<soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarNfseServicoPrestado" style="document"/>
			<wsdl:input name="ConsultarNfseServicoPrestado">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="ConsultarNfseServicoPrestadoResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="CancelarNfse">
			<soap:operation soapAction="http://nfse.abrasf.org.br/CancelarNfse" style="document"/>
			<wsdl:input name="CancelarNfse">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="CancelarNfseResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="ConsultarLoteRps">
			<soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarLoteRps" style="document"/>
			<wsdl:input name="ConsultarLoteRps">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="ConsultarLoteRpsResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="GerarNfse">
			<soap:operation soapAction="http://nfse.abrasf.org.br/GerarNfse" style="document"/>
			<wsdl:input name="GerarNfse">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="GerarNfseResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="SubstituirNfse">
			<soap:operation soapAction="http://nfse.abrasf.org.br/SubstituirNfse" style="document"/>
			<wsdl:input name="SubstituirNfse">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="SubstituirNfseResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="ConsultarNfsePorFaixa">
			<soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarNfsePorFaixa" style="document"/>
			<wsdl:input name="ConsultarNfsePorFaixa">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="ConsultarNfsePorFaixaResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="NfseImplService">
		<wsdl:port binding="tns:NfseImplServiceSoapBinding" name="NfseImplPort">
			<soap:address location="http://v2-ws-homologacao.giss.com.br/service-ws/nf/nfse-ws"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
